var zy = new Array();
zy[0]="茶叶生产加工技术";
zy[1]="城市燃气工程技术";
zy[2]="初等教育(理科方向)";
zy[3]="初等教育(文科方向)";
zy[4]="法律事务";
zy[5]="汉语国际教育";
zy[6]="汉语言文学";
zy[7]="化学";
zy[8]="化学教育";
zy[9]="计算机信息管理";
zy[10]="计算机应用技术";
zy[11]="酒店管理";
zy[12]="历史教育";
zy[13]="历史学";
zy[14]="旅游管理";
zy[15]="美术教育";
zy[16]="美术学";
zy[17]="农学";
zy[18]="烹饪工艺与营养";
zy[19]="生物技术及应用";
zy[20]="生物教育";
zy[21]="生物科学";
zy[22]="食品质量与安全";
zy[23]="数学教育";
zy[24]="数学与应用数学";
zy[25]="思想政治教育";
zy[26]="体育教育(本)";
zy[27]="体育教育(专)";
zy[28]="统计实务";
zy[29]="文秘";
zy[30]="物理教育";
zy[31]="物理学";
zy[32]="现代教育技术(计算机方向)";
zy[33]="小学教育(理科方向)";
zy[34]="小学教育(文科方向)";
zy[35]="信息管理与信息系统";
zy[36]="学前教育";
zy[37]="艺术设计";
zy[38]="音乐教育";
zy[39]="英语";
zy[40]="英语教育";
zy[41]="应用英语";
zy[42]="语文教育";
zy[43]="园林";
zy[44]="园林技术";
zy[45]="园艺技术";

window.onload=function(){
	var obj = document.getElementById("tkzy");
	var x;
	for (x in zy){
		obj.options.add(new Option(zy[x],zy[x]));//在当前选中的那个的值中改变
	}
}